uhnp/src/InformationRegisters/тн_ЗарегистрированныеДокументыКОбмену/тн_ЗарегистрированныеДокументыКОбмену.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ЗарегистрированныеДокументыКОбмену</name>
  <comment>//Блинова М.А. 20.02.2025 Выполнение задач №000052717</comment>
  <dimensions>
    <name>ЗарегистрированныйДокумент</name>
    <type>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>String</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов/тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов</name>
  <comment>// Юдина (Гутарова) Екатерина 04.04.2024 Выполнение задач №000049104</comment>
  <resources>
    <name>УдалитьГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>БазаРеспондентИД</name>
    <comment>// Чекордина Ирина 30.12.2025 Выполнение задач №000056058</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <comment>// Белоконенко Денис 13.03.2025 Выполнение задач №000053020</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/СчетФактураПолученный/СчетФактураПолученный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученный</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ПриобретениеУслугПрочихАктивов</basedOn>
  <basedOn>Document.ВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ВыкупВозвратнойТарыУПоставщика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ВыкупПринятыхНаХранениеТоваров</basedOn>
  <basedOn>Document.ОтчетПереработчика2_5</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>InformationRegister.ЖурналУчетаСчетовФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураОснование</name>
    <type>
      <types>DocumentRef.СчетФактураПолученный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВЭлектронномВиде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтнестиКПредыдущемуОтчетномуКварталу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиКнигиПокупок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставленКомиссионеромОтИмениПродавца</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СводныйКомиссионный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперацииНаУменьшение</name>
    <comment>Код вида операции при уменьшении стоимости (количества)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СводныйКорректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННКонтрагента</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КППКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаЖурналаСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаСуммДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиКнигиПродаж</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_УПД</name>
    <comment>ВЗ №000041271</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЗаписьДополнительногоЛиста</name>
    <comment>Выполнение задач №000041973</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_КорректируемыйПериод</name>
    <comment>Выполнение задач №000041973</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЗаписыватьНомерДатуВхВДокументОснования</name>
    <comment>№000044034</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НалогообложениеНДС</name>
    <comment>№000046864</comment>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_KindFacture</name>
    <comment>Выполнение задач №000047912</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеСчетФактураПолученный</types>
      </type>
    </attributes>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходныйДокумент</name>
      <type>
        <types>DocumentRef.СчетФактураПолученный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУвеличение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУвеличение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУменьшение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУвеличениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУвеличениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУменьшениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>тн_ГуидДокументаОснования</name>
      <comment>Выполнение задач №000043965</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦенности</name>
      <type>
        <types>EnumRef.ВидыЦенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоКВычетуНДСДоВводаОстатков</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоВводаОстатков</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продавцы</name>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННПродавца</name>
      <type>
        <types>DefinedType.ИНН</types>
      </type>
    </attributes>
    <attributes>
      <name>КПППродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/тн_ПравилаИнтеграционнойСхемы/тн_ПравилаИнтеграционнойСхемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тн_ПравилаИнтеграционнойСхемы</name>
  <comment>// Юдина Екатерина 04.12.2025 Выполнение задач №000056034</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяОбъектовМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицыСхем</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСхемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыСхем</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСвойстваСхемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазрешенаПравка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/тн_Интеграция_УПП_Подписки/Module.bsl
// Борисенко И.Н. 14.10.2020 Выполнение задачи №000035594
Процедура тн_РегистрацияДляВыгрузки_УПП_ЗаписьПриЗаписи(Источник, Отказ) Экспорт
	
	тн_РегистрацияДляВыгрузки_ЗаписьПриЗаписи(Источник, Отказ, "Каркас");
	
КонецПроцедуры

// Борисенко Игорь 22.06.2021 Выполнение задач №000038257
Процедура тн_РегистрацияДляВыгрузки_ЗУП_ЗаписьПриЗаписи(Источник, Отказ) Экспорт

	тн_РегистрацияДляВыгрузки_ЗаписьПриЗаписи(Источник, Отказ, "ЗУП");
	
КонецПроцедуры

// Белоконенко Денис 18.02.2022 Выполнение задач №000040436
Процедура тн_РегистрацияДляВыгрузки_УПП_ОКС_ЗаписьПриЗаписи(Источник, Отказ) Экспорт

	тн_РегистрацияДляВыгрузки_ЗаписьПриЗаписи(Источник, Отказ, "ОКС");
	
КонецПроцедуры

// Борисенко Игорь 19.12.2022 Выполнение задач №000043725
Процедура тн_РегистрацияДляВыгрузки_ЦБ_ЗаписьПриЗаписи(Источник, Отказ) Экспорт

	тн_РегистрацияДляВыгрузки_ЗаписьПриЗаписи(Источник, Отказ, "ЦБ");
	
КонецПроцедуры 

// Борисенко Игорь 21.10.2022 Выполнение задач №000043052
Процедура тн_РегистрацияДляВыгрузки_ЗаписьПриЗаписи(Источник, Отказ, НаправлениеВыгрузки) Экспорт
	
	//НАЧАЛО Качикина 16.10.2024 Выполнение задач №000051011
	//Если Источник.ОбменДанными.Загрузка = Истина Тогда
	Если Источник.ОбменДанными.Загрузка = Истина
		И НЕ (Источник.ДополнительныеСвойства.Свойство("ПринудительноЗарегистрировать") И Источник.ДополнительныеСвойства.ПринудительноЗарегистрировать = Истина) Тогда
	//КОНЕЦ Качикина 16.10.2024 Выполнение задач №000051011	
		Возврат; //чтобы не было заикливаний выгрузок
	КонецЕсли; 
		
	ТочкаОбменаRabbitMQ = Справочники.ТочкиОбменаRMQ.ТекущаяБаза;
	Если ЗначениеЗаполнено(ТочкаОбменаRabbitMQ) Тогда
		Если Не тн_Интеграция_УПП.НужноВыгружать(ТочкаОбменаRabbitMQ.Наименование, Источник.Ссылка, НаправлениеВыгрузки) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Источник.Ссылка);
	тн_Интеграция_УПП.ЗарегистрироватьСвязанныеОбъектыДляВыгрузки_ERP_УХ(АдресВременногоХранилища, НаправлениеВыгрузки);
	//НАЧАЛО Блинова М.А. 20.02.2025 Выполнение задач №000052717 
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПрочиеДоходыРасходы") Тогда
		НаборЗаписейРегистра = РегистрыСведений.тн_ЗарегистрированныеДокументыКОбмену.СоздатьНаборЗаписей();
		НаборЗаписейРегистра.Отбор.ЗарегистрированныйДокумент.Установить(Источник.Ссылка);
		НаборЗаписейРегистра.Записать();
	КонецЕсли;
	//КОНЕЦ Блинова М.А. 20.02.2025 Выполнение задач №000052717 
	
КонецПроцедуры

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Процедура тн_РегистрацияДляВыгрузки_ЦБ_ЗаписьРегистрыПриЗаписи(Источник, Отказ, Замещение) Экспорт

	тн_РегистрацияДляВыгрузки_ЗаписьРегистрыПриЗаписи(Источник, Отказ, "ЦБ");
	
КонецПроцедуры

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Процедура тн_РегистрацияДляВыгрузки_ЗаписьРегистрыПриЗаписи(Источник, Отказ, НаправлениеВыгрузки) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат; //чтобы не было зацикливаний выгрузок
	КонецЕсли;
		
	ТочкаОбменаRabbitMQ = Справочники.ТочкиОбменаRMQ.ТекущаяБаза;
	Если ЗначениеЗаполнено(ТочкаОбменаRabbitMQ) Тогда
		Если Не тн_Интеграция_УПП.НужноВыгружать(ТочкаОбменаRabbitMQ.Наименование, Источник, НаправлениеВыгрузки) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	тн_Интеграция_УПП.ЗарегистрироватьСвязанныеОбъектыДляВыгрузки_ERP_УХ(Источник, НаправлениеВыгрузки);
	
КонецПроцедуры 

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Процедура тн_ФедеральныеСправочники_КонтрольИзмененияПередЗаписью(Источник, Отказ) Экспорт
		
	// НАЧАЛО Юдина Екатерина 04.12.2025 Выполнение задач №000056034
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// КОНЕЦ Юдина Екатерина 04.12.2025 Выполнение задач №000056034
	
	РеквизитыИсточника = Источник.Метаданные().Реквизиты;
	
	// НАЧАЛО Одинец Р.Ю. 03.10.2024 Выполнение задач №000048378
	//Если Не РеквизитыИсточника.Найти("тн_ЯвляетсяобъектомЦБ") = Неопределено Тогда 
	Если РеквизитыИсточника.Найти("тн_ЯвляетсяобъектомЦБ") <> Неопределено
		ИЛИ РеквизитыИсточника.Найти("ЯвляетсяобъектомЦБ") <> Неопределено Тогда 
		// КОНЕЦ Одинец Р.Ю. 03.10.2024 Выполнение задач №000048378
		
// НАЧАЛО Юдина Екатерина 04.12.2025 Выполнение задач №000056034
		#Область Старый_код	 
		//Если Источник.ОбменДанными.Загрузка Тогда
		//	Возврат;
		//КонецЕсли;
		//	// НАЧАЛО Одинец Р.Ю. 03.10.2024 Выполнение задач №000048378
		//	//Если Источник.ЭтоНовый() Тогда 
		//	//	Отказ = Истина;
		//	//	ОбщегоНазначения.СообщитьПользователю("Добавлять элементы в справочник можно только в ЦБ!",,,Отказ);
		//	//	Возврат;
		//	//КонецЕсли;	
		//	
		//	//НАЧАЛО Качикина 08.12.2025 Выполнение задач №000056076
		//	//Отказ = Истина;
		//	//КОНЕЦ Качикина 08.12.2025 Выполнение задач №000056076
		//	
		//	Если Источник.ЭтоНовый() Тогда
		//		//НАЧАЛО Качикина 08.12.2025 Выполнение задач №000056076 
		//		Отказ = Истина;
		//		//КОНЕЦ Качикина 08.12.2025 Выполнение задач №000056076
		//		ОбщегоНазначения.СообщитьПользователю("Добавлять элементы в справочник можно только в ЦБ!",,,Отказ);
		//	Иначе  
		//		//НАЧАЛО Качикина 08.12.2025 Выполнение задач №000056076
		//		//ОбщегоНазначения.СообщитьПользователю("Изменять элементы справочника можно только в ЦБ!",,,Отказ);  
		//		//федеральные справочники, для которых доступно изменение существующих НЕфедеральных элементов
		//		ДоступныеДляИзмененияСправочники = Новый Соответствие; 
		//		ДоступныеДляИзмененияСправочники.Вставить(Тип("СправочникОбъект.СтруктураПредприятия"), "тн_ЯвляетсяобъектомЦБ"); 
		//
		//		ТипИсточника = ТипЗнч(Источник);
		//		РеквизитДляПроверки		= ДоступныеДляИзмененияСправочники.Получить(ТипИсточника);
		//		
		//		ЭтоНефедеральныйЭлемент = ЗначениеЗаполнено(РеквизитДляПроверки)
		//									И НЕ Источник[РеквизитДляПроверки] 
		//									И Источник.Ссылка[РеквизитДляПроверки] = Источник[РеквизитДляПроверки];
		//		
		//		Если НЕ ЭтоНефедеральныйЭлемент Тогда
		//			Отказ = Истина;  
		//			ОбщегоНазначения.СообщитьПользователю("Изменять элементы справочника можно только в ЦБ!",,,Отказ);
		//		КонецЕсли;
		//		//КОНЕЦ Качикина 08.12.2025 Выполнение задач №000056076
		//	КонецЕсли;	
		
		//	Возврат;
		//	// КОНЕЦ Одинец Р.Ю. 03.10.2024 Выполнение задач №000048378
		#КонецОбласти	
		
		// Справочники, которые полностью запрещено редактировать в ЕРП: 
		// и заводить новые элементы, и редактировать полученные по обмену. 
		ЗапрещённыеКРедактированиюСправочники = Новый Массив;
		ЗапрещённыеКРедактированиюСправочники.Добавить(Тип("СправочникОбъект.тн_ОбъектыНЗС"));
		ЗапрещённыеКРедактированиюСправочники.Добавить(Тип("СправочникОбъект.тн_СтратегическиеБизнесЕдиницы"));  
		
		Если ЗапрещённыеКРедактированиюСправочники.Найти(ТипЗнч(Источник)) <> Неопределено Тогда 
			
			Если Источник.ЭтоНовый() Тогда
				ОбщегоНазначения.СообщитьПользователю("Добавлять элементы в справочник можно только в ЦБ!",,,, Отказ);
			Иначе  
				ОбщегоНазначения.СообщитьПользователю("Изменять элементы справочника можно только в ЦБ!",,,, Отказ);  
			КонецЕсли;	
			
			Возврат;
			
		КонецЕсли;
		// КОНЕЦ Юдина Екатерина 04.12.2025 Выполнение задач №000056034  
		
	КонецЕсли;
	
	// НАЧАЛО Юдина Екатерина 04.12.2025 Выполнение задач №000056034
	Если тн_ОбщегоНазначения.ЯвляетсяОбъектомЦБ(Источник.Ссылка) Тогда
		
		МассивРеквизитовДляПроверки = Новый Массив;
		МассивРеквизитовДляПроверки.Добавить("ПометкаУдаления");
		
		Запрос = Новый Запрос;                         
		ИмяОбъектаМетаданных = Источник.Метаданные().Имя;
		Запрос.УстановитьПараметр("ИмяОбъектовМетаданных", "Справочник." + ИмяОбъектаМетаданных);
		Запрос.УстановитьПараметр("МассивРеквизитовДляПроверки", МассивРеквизитовДляПроверки);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаИнтеграционнойСхемыРеквизитыСхем.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	Справочник.тн_ПравилаИнтеграционнойСхемы КАК ПравилаИнтеграционнойСхемы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тн_ПравилаИнтеграционнойСхемы.РеквизитыСхем КАК ПравилаИнтеграционнойСхемыРеквизитыСхем
		|		ПО ПравилаИнтеграционнойСхемы.Ссылка = ПравилаИнтеграционнойСхемыРеквизитыСхем.Ссылка
		|ГДЕ
		|	ПравилаИнтеграционнойСхемы.ИмяОбъектовМетаданных = &ИмяОбъектовМетаданных 		
		|	И НЕ ПравилаИнтеграционнойСхемы.ПометкаУдаления
		|	И НЕ ПравилаИнтеграционнойСхемыРеквизитыСхем.РазрешенаПравка
		|	И ПравилаИнтеграционнойСхемыРеквизитыСхем.ИмяРеквизита В (&МассивРеквизитовДляПроверки)";
				
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			Если Не Источник[Выборка.ИмяРеквизита] = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Источник.Ссылка, Выборка.ИмяРеквизита) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Запрещено менять реквизит %1 у федеральных элементов этого справочника!", Выборка.ИмяРеквизита),,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	// КОНЕЦ Юдина Екатерина 04.12.2025 Выполнение задач №000056034
	
КонецПроцедуры 

// Юдина (Гутарова) Екатерина 04.04.2024 Выполнение задач №000049104
//
Процедура тн_ПроверкаЗагрузкиЗависимыхОбъектов_ПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;   
	
	ГУИД = Строка(Источник.Ссылка.УникальныйИдентификатор());
	//НАЧАЛО Блинова М.А. 01.07.2024 Выполнение задач №000050060
	//нужно еще справочник проверить
	Если Источник.Метаданные().Имя = "ДоговорыКонтрагентов" Тогда 
		ВидДокумента = "Справочник.ДоговорыКонтрагентов"    
	// НАЧАЛО Юдина Екатерина 31.01.2025 Выполнение задач №000052460  
	ИначеЕсли Источник.Метаданные().Имя = "СпособыОтраженияРасходов" Тогда
		ВидДокумента = "Справочник.СпособыОтраженияРасходов"
	// КОНЕЦ Юдина Екатерина 31.01.2025 Выполнение задач №000052460
	Иначе
	//КОНЕЦ Блинова М.А. 01.07.2024 Выполнение задач №000050060
	ВидДокумента = "Документ." + Источник.Метаданные().Имя; 
	//НАЧАЛО Блинова М.А. 01.07.2024 Выполнение задач №000050060
	КонецЕсли;
	//КОНЕЦ Блинова М.А. 01.07.2024 Выполнение задач №000050060
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.ИДСообщения КАК ИДСообщения,
	               |	тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.ВидДокумента КАК ВидДокумента
	               |ИЗ
	               |	РегистрСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов КАК тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов
	               |ГДЕ   
				   |	тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.ГУИД = &ГУИД";	
	
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.СоздатьМенеджерЗаписи();
		Запись.ИДСообщения = Выборка.ИДСообщения;
		Запись.ГУИД = ГУИД;
		Запись.ВидДокумента = Выборка.ВидДокумента;
		Запись.Прочитать();
		Запись.Удалить();	
        // НАЧАЛО Юдина Екатерина 17.12.2025 Выполнение задач №000056166   
		Если ОбщегоНазначенияПовтИспУХ.ПолучитьЗначениеКонстанты("тн_ВключитьДополнительноеЛогированиеВЖурналРегистрации") Тогда
			
			ЗаписьЖурналаРегистрации("Удаление РС_ОчередьОжиданияЗагрузкиЗависимыхОбъектов по", УровеньЖурналаРегистрации.Информация, 
			    Метаданные.РегистрыСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов, Источник.Ссылка, Строка(ГУИД) + " " + Строка(Источник.Ссылка) + " / " + Строка(Выборка.ИДСообщения));
			
		КонецЕсли;	
		// КОНЕЦ Юдина Екатерина 17.12.2025 Выполнение задач №000056166
		
	КонецЦикла;   
		
КонецПроцедуры 

#Область ОписанияJSON

// Борисенко И.Н. 05.11.2020 Выполнение задачи №000035594
Функция СформироватьТаблицуОбъектов(НаправлениеВыгрузки = "Каркас") Экспорт
	
	АдресВременногоХранилища = тн_Интеграция_УПП.СформироватьТаблицуОбъектов(НаправлениеВыгрузки);
	Возврат АдресВременногоХранилища;
	
КонецФункции

// Борисенко И.Н. 03.12.2021 Выполнение задач №000039277
Функция СформироватьОписаниеJSON(ИмяОбъектаМетаданных, СтрокаУИД = "", НаправлениеВыгрузки = "") Экспорт
	
	СтруктураОписаниеJSON = тн_Интеграция_УПП.СформироватьОписаниеJSON(ИмяОбъектаМетаданных, СтрокаУИД, НаправлениеВыгрузки);
	Возврат СтруктураОписаниеJSON;
	
КонецФункции

// Борисенко Игорь 13.01.2023 Выполнение задач №000043965
Процедура тн_ПровестиСвязанныеСчФПолученныеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ГУИД = Источник.Ссылка.УникальныйИдентификатор();
	сГУИД = Строка(ГУИД);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тн_ГуидДокументаОснования", сГУИД);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.тн_ГуидДокументаОснования = &тн_ГуидДокументаОснования
	// НАЧАЛО Борисенко Игорь 19.06.2023 Выполнение задач №000045867
	|	И Не СчетФактураПолученныйДокументыОснования.Ссылка.ПометкаУдаления
	// КОНЕЦ Борисенко Игорь 19.06.2023 Выполнение задач №000045867
	|	И Не СчетФактураПолученныйДокументыОснования.Ссылка.Проведен"; 
	
	// НАЧАЛО Белоконенко Денис 20.04.2023 Выполнение задач №000045246 
	ЭтоЗагрузкаСЗавода = Ложь;
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоЗагрузкаСЗавода") И
		Источник.ДополнительныеСвойства.ЭтоЗагрузкаСЗавода Или
		Источник.ДополнительныеСвойства.Свойство("operationType") И 
		Источник.ДополнительныеСвойства.operationType = "КаркасПродажаГП" Тогда			
		ЭтоЗагрузкаСЗавода = Истина;
	КонецЕсли;
	
	Если ЭтоЗагрузкаСЗавода Тогда // Обновляем всегда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Не СчетФактураПолученныйДокументыОснования.Ссылка.Проведен", "");
	КонецЕсли;
	// КОНЕЦ Белоконенко Денис 20.04.2023 Выполнение задач №000045246	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		обСчФ = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаОснования Из обСчФ.ДокументыОснования Цикл
			
			Если СтрокаОснования.тн_ГуидДокументаОснования = сГУИД Тогда
				
				СтрокаОснования.ДокументОснование = Источник.Ссылка;
				
			КонецЕсли;
			
		КонецЦикла; //по СтрокаОснования
		
		Попытка
			// НАЧАЛО Белоконенко Денис 19.01.2023 Выполнение задач №000044034
			// НАЧАЛО Белоконенко Денис 31.03.2023 Выполнение задач №000045021
			//Если Источник.ДополнительныеСвойства.Свойство("operationType") И
			Если Источник.ДополнительныеСвойства.Свойство("ЭтоЗагрузкаСЗавода") И
				Источник.ДополнительныеСвойства.ЭтоЗагрузкаСЗавода Или
				Источник.ДополнительныеСвойства.Свойство("operationType") И
			// КОНЕЦ Белоконенко Денис 31.03.2023 Выполнение задач №000045021 
				Источник.ДополнительныеСвойства.operationType = "КаркасПродажаГП" Тогда			
				тн_Интеграция_ERP_УХ.ЗаполнитьСФПоОснованию(обСчФ, Источник.Ссылка);
			КонецЕсли;
			// КОНЕЦ  Белоконенко Денис 19.01.2023 Выполнение задач №000044034
			
			обСчФ.ОбменДанными.Загрузка = Истина;
			обСчФ.Записать();

			обСчФ.ОбменДанными.Загрузка = Ложь;
			обСчФ.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
			
			ТекстСообщения = СтрШаблон("Не удалось провести связанный: %1", СокрЛП(обСчФ));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			
		КонецПопытки;
		
	КонецЦикла; //по СчФ
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Борисенко Игорь 19.07.2023 Выполнение задач №000046267
Процедура тн_ПровестиСвязанныеСчФВыданныеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//НАЧАЛО Качикина 13.11.2025 Выполнение задач №000055808
	//при загрузке РОТ к РТУ в закрытом периоде не надо ничего перепроводить!
	Если Источник.ДополнительныеСвойства.Свойство("тн_ПринудительноеПроведениеВЗакрытомПериоде")
		И Источник.ДополнительныеСвойства.тн_ПринудительноеПроведениеВЗакрытомПериоде Тогда
		Возврат;	
	КонецЕсли;
	//КОНЕЦ Качикина 13.11.2025 Выполнение задач №000055808
	
	УстановитьПривилегированныйРежим(Истина);
	
	ГУИД = Источник.Ссылка.УникальныйИдентификатор();
	сГУИД = Строка(ГУИД);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тн_ГуидДокументаОснования", сГУИД);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.тн_ГуидДокументаОснования = &тн_ГуидДокументаОснования
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления"; 
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		обСчФ = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаОснования Из обСчФ.ДокументыОснования Цикл
			
			Если СтрокаОснования.тн_ГуидДокументаОснования = сГУИД Тогда
				
				СтрокаОснования.ДокументОснование = Источник.Ссылка;
				
			КонецЕсли;
			
		КонецЦикла; //по СтрокаОснования
		
		Попытка
			
			обСчФ.ОбменДанными.Загрузка = Истина;
			обСчФ.Записать();

			обСчФ.ОбменДанными.Загрузка = Ложь;
			обСчФ.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
			
			ТекстСообщения = СтрШаблон("Не удалось провести связанный: %1", СокрЛП(обСчФ));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			
		КонецПопытки;
		
	КонецЦикла; //по СчФ
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Борисенко Игорь 12.01.2024 Выполнение задач №000048096
Процедура тн_Номенклатура_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Запрос.УстановитьПараметр("Наименование", Источник.Наименование);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И Номенклатура.Ссылка <> &Ссылка
		|	И Номенклатура.Наименование = &Наименование";
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			//НАЧАЛО Сафиуллина З.Р. 30.10.2025 Выполнение задач №000055674
			//КраткийТекстСообщения = СтрШаблон("ДУБЛЬ группы номенклатуры: %1", Выборка.Наименование);
			//КОНЕЦ Сафиуллина З.Р. 30.10.2025 Выполнение задач №000055674
			ПолныйТекстСообщения = СтрШаблон("ДУБЛЬ группы номенклатуры. Код: %1; Наименование: %2; Родитель: %3", Выборка.Код, Выборка.Наименование, Источник.Родитель);
			
			//НАЧАЛО Сафиуллина З.Р. 30.10.2025 Выполнение задач №000055674
			//ЗаписьЖурналаРегистрации(КраткийТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПолныйТекстСообщения); 
			ЗаписьЖурналаРегистрации("Запись группы номенклатуры", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура,
				Источник.Ссылка, ПолныйТекстСообщения);
	        //КОНЕЦ Сафиуллина З.Р. 30.10.2025 Выполнение задач №000055674
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
